Revit 2027 API
RegenerationOption Enumeration
 All regeneration options supported by Revit external commands and external applications.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RegenerationOption
Public Enumeration RegenerationOption
public enum class RegenerationOption
type RegenerationOption
Members
Member name | Value | Description
Manual | 0 |  The API framework will not regenerate after every model level change. Instead, you may use the regeneration APIs to force update of the document after a group of changes. SuspendUpdating blocks are unnecessary and should not be used. Performance of multiple modifications of the Revit document should be faster than RegenerationOption.Automatic. Because this mode suspends all updates to the document, your application should not read data from the document after it has been modified until the document has been regenerated, or it runs the risk of accessing stale data. This mode will be only option in a future release.
See Also
Reference
Autodesk.Revit.Attributes Namespace